In [2]:
import numpy as np
import pandas as pd

In [ ]:
# Pandas  <= numpy
# python으로하는 excel
# datatype
# 1. Series <-  numpy 1차원 vector
# 2. DataFrame <- series가 여러개 column으로 이어서 만들어진 matrix <- numpy matrix

### Series
* numpy array vector - index가 없다
* series <= numpy array vector + index
* pd.Series()

In [98]:
L = [1,2,3,4]
s = pd.Series(L, index = ['a','b','c','d'])
s

a    1
b    2
c    3
d    4
dtype: int64

In [99]:
s['c']

3

In [100]:
s['c'] = 10
s

a     1
b     2
c    10
d     4
dtype: int64

In [101]:
s[['c','d']]

c    10
d     4
dtype: int64

In [102]:
s > 5       # broadcasting > element wise operating

a    False
b    False
c     True
d    False
dtype: bool

In [103]:
s[ s > 5 ]    # boolean indexing    ## 왜 답이 이상해?

c    10
dtype: int64

In [104]:
s * 2

a     2
b     4
c    20
d     8
dtype: int64

In [18]:
'a' in s

True

In [19]:
s

a    1
b    2
c    3
d    4
dtype: int64

In [20]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [21]:
s.values

array([1, 2, 3, 4], dtype=int64)

In [22]:
s.index = ['가','나','다','라']
s

가    1
나    2
다    3
라    4
dtype: int64

### DataFrame
* series 가 column 단위로 붙어서 만들어진 matrix(series => dataframe)
* pd.DataFrame()

In [108]:
raw_data = {'first_name':['jason', np.nan, 'tina', 'jake', 'amy'],
           'last_name':['miller', np.nan, 'ali', 'miller', 'coozer'],
            'age':[42, np.nan, 36, 24, 73],
            'pretestscore' : [4, np.nan, np.nan, 2, 4],
            'posttestscre' : [25,np.nan, np.nan, 62,72]
           }
            #pretetcore

In [32]:
# key : 이메일

In [109]:
# value :clus 값
df = pd.DataFrame(raw_data)
df

  first_name last_name   age  pretestscore  posttestscre
0      jason    miller  42.0           4.0          25.0
1        NaN       NaN   NaN           NaN           NaN
2       tina       ali  36.0           NaN           NaN
3       jake    miller  24.0           2.0          62.0
4        amy    coozer  73.0           4.0          72.0

In [34]:
# 데잍르 각ㅇ할 때, 일반적, 보편적 처리 방식
# column - 특정 칼럼으로 잡는다 예 - 학생 학년, 이름, 주소, 성적
# row - 개별 데이터. 예 - 첫번째 학생, 두번째 학생 

# column - feature, 열,
# row - data, 행

In [35]:
# 하나의 칼럼 - 하나의 series < np,array < 원소가 동일한 데이터타입으로 구성
# dataframe - series가 연결된 matrix

#하나의 칼럼에는 동일한 타입의 데이터로 구성된다
# 칼럼 간에는 다른 데이터타입의 칼럼들이 존재한다

In [110]:
df

  first_name last_name   age  pretestscore  posttestscre
0      jason    miller  42.0           4.0          25.0
1        NaN       NaN   NaN           NaN           NaN
2       tina       ali  36.0           NaN           NaN
3       jake    miller  24.0           2.0          62.0
4        amy    coozer  73.0           4.0          72.0

In [37]:
# column indexing => df[column]

In [111]:
df.head(2)

  first_name last_name   age  pretestscore  posttestscre
0      jason    miller  42.0           4.0          25.0
1        NaN       NaN   NaN           NaN           NaN

In [112]:
df['first_name']

0    jason
1      NaN
2     tina
3     jake
4      amy
Name: first_name, dtype: object

In [113]:
df[['last_name', 'age']]

  last_name   age
0    miller  42.0
1       NaN   NaN
2       ali  36.0
3    miller  24.0
4    coozer  73.0

In [114]:
df.first_name
# 속성으로 칼럼을 접근하는 방식
# 1. 칼럼이름에 space가 있으면 안 됨
# 2. 칼럼을 수정할 때 주의가 필요

0    jason
1      NaN
2     tina
3     jake
4      amy
Name: first_name, dtype: object

In [116]:
df['age'] = df['age'].apply(lambda x:x*10)   # age에 10 곱하기
df

  first_name last_name     age  pretestscore  posttestscre
0      jason    miller  4200.0           4.0          25.0
1        NaN       NaN     NaN           NaN           NaN
2       tina       ali  3600.0           NaN           NaN
3       jake    miller  2400.0           2.0          62.0
4        amy    coozer  7300.0           4.0          72.0

In [117]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [48]:
df.columns

Index(['first_name', 'last_name', 'age', 'pretestscore', 'posttestscre'], dtype='object')

In [49]:
df.values    # array

array([['jason', 'miller', 420.0, 4.0, 25.0],
       [nan, nan, nan, nan, nan],
       ['tina', 'ali', 360.0, nan, nan],
       ['jake', 'miller', 240.0, 2.0, 62.0],
       ['amy', 'coozer', 730.0, 4.0, 72.0]], dtype=object)

In [ ]:
# # row indexing

# df.loc[index name]
# df.iloc[index order num]

# loc[]. iloc[] - row와 column을 동시에 선택할 수도 잇다

In [50]:
df.index = ['a','b','c','d','e']
df

  first_name last_name    age  pretestscore  posttestscre
a      jason    miller  420.0           4.0          25.0
b        NaN       NaN    NaN           NaN           NaN
c       tina       ali  360.0           NaN           NaN
d       jake    miller  240.0           2.0          62.0
e        amy    coozer  730.0           4.0          72.0

In [51]:
df.loc['d']

first_name        jake
last_name       miller
age              240.0
pretestscore       2.0
posttestscre      62.0
Name: d, dtype: object

In [52]:
df.iloc[3]      #순번

first_name        jake
last_name       miller
age              240.0
pretestscore       2.0
posttestscre      62.0
Name: d, dtype: object

In [53]:
df.iloc[3:]

  first_name last_name    age  pretestscore  posttestscre
d       jake    miller  240.0           2.0          62.0
e        amy    coozer  730.0           4.0          72.0

In [54]:
df.loc['d':]

  first_name last_name    age  pretestscore  posttestscre
d       jake    miller  240.0           2.0          62.0
e        amy    coozer  730.0           4.0          72.0

In [56]:
df.loc[['c','e']]

  first_name last_name    age  pretestscore  posttestscre
c       tina       ali  360.0           NaN           NaN
e        amy    coozer  730.0           4.0          72.0

In [57]:
df.iloc[[2,4]]

  first_name last_name    age  pretestscore  posttestscre
c       tina       ali  360.0           NaN           NaN
e        amy    coozer  730.0           4.0          72.0

In [58]:
df.loc['b':'d']

  first_name last_name    age  pretestscore  posttestscre
b        NaN       NaN    NaN           NaN           NaN
c       tina       ali  360.0           NaN           NaN
d       jake    miller  240.0           2.0          62.0

In [ ]:
# loc[row name, col name]. # iloc[row index, col index]. iloc[] 
# - row와 column을 동시에 선택할 수도 잇다

In [59]:
df

  first_name last_name    age  pretestscore  posttestscre
a      jason    miller  420.0           4.0          25.0
b        NaN       NaN    NaN           NaN           NaN
c       tina       ali  360.0           NaN           NaN
d       jake    miller  240.0           2.0          62.0
e        amy    coozer  730.0           4.0          72.0

In [60]:
df.loc['c', 'last_name']    # 행, 열

'ali'

In [61]:
df.iloc[2,1]

'ali'

In [63]:
df.loc[['c','d'], 'first_name' : 'age']

  first_name last_name    age
c       tina       ali  360.0
d       jake    miller  240.0

In [64]:
df.iloc[[2,3], :3]

  first_name last_name    age
c       tina       ali  360.0
d       jake    miller  240.0

In [65]:
df

  first_name last_name    age  pretestscore  posttestscre
a      jason    miller  420.0           4.0          25.0
b        NaN       NaN    NaN           NaN           NaN
c       tina       ali  360.0           NaN           NaN
d       jake    miller  240.0           2.0          62.0
e        amy    coozer  730.0           4.0          72.0

In [67]:
df.loc['d','pretestscore'] = 100
df

  first_name last_name    age  pretestscore  posttestscre
a      jason    miller  420.0           4.0          25.0
b        NaN       NaN    NaN           NaN           NaN
c       tina       ali  360.0           NaN           NaN
d       jake    miller  240.0         100.0          62.0
e        amy    coozer  730.0           4.0          72.0

In [71]:
df.loc[['c','e'], ['age','posttestscre']]

     age  posttestscre
c  360.0           NaN
e  730.0          72.0

In [73]:
df.iloc[[2,4],[2,4]]

     age  posttestscre
c  360.0           NaN
e  730.0          72.0

In [74]:
df.loc['d':,'pretestscore']

d    100.0
e      4.0
Name: pretestscore, dtype: float64

In [75]:
df.iloc[3:,3:]

   pretestscore  posttestscre
d         100.0          62.0
e           4.0          72.0

In [76]:
df

  first_name last_name    age  pretestscore  posttestscre
a      jason    miller  420.0           4.0          25.0
b        NaN       NaN    NaN           NaN           NaN
c       tina       ali  360.0           NaN           NaN
d       jake    miller  240.0         100.0          62.0
e        amy    coozer  730.0           4.0          72.0

In [80]:
df.iloc[::2]        # 홀수번째 인덱스만

  first_name last_name    age  pretestscore  posttestscre
a      jason    miller  420.0           4.0          25.0
c       tina       ali  360.0           NaN           NaN
e        amy    coozer  730.0           4.0          72.0

In [81]:
df.iloc[1:5:2, :]           # loc[row name, col name]. iloc[]

  first_name last_name    age  pretestscore  posttestscre
b        NaN       NaN    NaN           NaN           NaN
d       jake    miller  240.0         100.0          62.0

In [ ]:
# dataframe에 boolean indexing도 가능하다 => row indexing : loc[]

In [82]:
df

  first_name last_name    age  pretestscore  posttestscre
a      jason    miller  420.0           4.0          25.0
b        NaN       NaN    NaN           NaN           NaN
c       tina       ali  360.0           NaN           NaN
d       jake    miller  240.0         100.0          62.0
e        amy    coozer  730.0           4.0          72.0

In [83]:
df.loc[df['age'] >= 40]

  first_name last_name    age  pretestscore  posttestscre
a      jason    miller  420.0           4.0          25.0
c       tina       ali  360.0           NaN           NaN
d       jake    miller  240.0         100.0          62.0
e        amy    coozer  730.0           4.0          72.0

In [86]:
# 'last_name'이 'ali'인 사람의 데이터 추출

df.loc[df['last_name'] == "ali", 'posttestscre']

c   NaN
Name: posttestscre, dtype: float64

In [ ]:
# 나이가 40 이상인 사람의 postestscore 평균점수는 얼마인가?
# df.loc[df['age'] >= 40]

df[df['age']>= 40]['posttestscore'].mean()

In [ ]:
# 새로운 칼럼 추가

In [88]:
df['address'] = ['seoul','incheon','daejeon','pusan','gwangju']
df

  first_name last_name    age  pretestscore  posttestscre  address
a      jason    miller  420.0           4.0          25.0    seoul
b        NaN       NaN    NaN           NaN           NaN  incheon
c       tina       ali  360.0           NaN           NaN  daejeon
d       jake    miller  240.0         100.0          62.0    pusan
e        amy    coozer  730.0           4.0          72.0  gwangju

In [ ]:
# 칼럼명 수정

In [89]:
df.columns = ['fn','ln','age','pres','posts','add']
df

      fn      ln    age   pres  posts      add
a  jason  miller  420.0    4.0   25.0    seoul
b    NaN     NaN    NaN    NaN    NaN  incheon
c   tina     ali  360.0    NaN    NaN  daejeon
d   jake  miller  240.0  100.0   62.0    pusan
e    amy  coozer  730.0    4.0   72.0  gwangju

In [93]:
df.rename(columns = {'add':'address'})      #바뀌어 보임
df           # 땡 안바꼈지롱
# df = df.rename(columns = {'add':'address'})   # 찐바꾸기
df.rename(columns = {'add':'address'}, inplace=True)     # 찐바꾸기
df

      fn      ln    age   pres  posts  address
a  jason  miller  420.0    4.0   25.0    seoul
b    NaN     NaN    NaN    NaN    NaN  incheon
c   tina     ali  360.0    NaN    NaN  daejeon
d   jake  miller  240.0  100.0   62.0    pusan
e    amy  coozer  730.0    4.0   72.0  gwangju

In [ ]:
# column 또는 row를 삭제

In [94]:
df.drop('address', axis=1)        # axis : drop에서는 세로가 1   # 가짜 바꿈

      fn      ln    age   pres  posts
a  jason  miller  420.0    4.0   25.0
b    NaN     NaN    NaN    NaN    NaN
c   tina     ali  360.0    NaN    NaN
d   jake  miller  240.0  100.0   62.0
e    amy  coozer  730.0    4.0   72.0

In [ ]:
df.drop('address', axis=1, inplace=True)  # 찐 삭제

In [95]:
df.drop('c')           # row를 삭제할때는 axis 필요없어

      fn      ln    age   pres  posts  address
a  jason  miller  420.0    4.0   25.0    seoul
b    NaN     NaN    NaN    NaN    NaN  incheon
d   jake  miller  240.0  100.0   62.0    pusan
e    amy  coozer  730.0    4.0   72.0  gwangju

In [97]:
df.drop(['ln','pres'], axis=1)

      fn    age  posts  address
a  jason  420.0   25.0    seoul
b    NaN    NaN    NaN  incheon
c   tina  360.0    NaN  daejeon
d   jake  240.0   62.0    pusan
e    amy  730.0   72.0  gwangju